#include <bits/stdc++.h>

int main() {
    printf("인생에서 무언가에 미칠 수 것은 얼마나 큰 행운일까요.\n");
    printf("백준은 제 인생에서 행운이였습니다.\n");
    printf("접점이라곤 하나도 없던 울산의 한 일반고에서\n");
    printf("운명처럼 백준이라는 사이트를 접하고\n");
    printf("그날부터 저는 '단계별로 풀어보기'를 끝까지 푸는 것을 목표로 삼았습니다.\n");
    printf("그 목표는 51번째 기하3에서 멈추게 되었지만요.\n\n");

    printf("3일 내내 한 문제에 대해서 고민해 본 경험\n");
    printf("달이 차오른다, 가자 문제를 장기하 노래 원곡을 틀고 풀어본 경험\n");
    printf("새로운 알고리즘에 머리가 깨지고 결국 해결한 경험\n");
    printf("열심히 하는 모습을 보여 아버지께 노트북을 선물받은 경험\n");
    printf("결국 공부와 노력이 결실을 맺어 ssu cse에 26학번으로 입학한 경험\n");
    printf("대학에 와서 주변 인물이 바뀌고 제 노력이 인정받은 경험\n\n");
    
    printf("모든 경험이 BOJ로부터 시작되었습니다. 결국에 다이아5까지 찍었네요.\n");
    printf("다시 돌아온다면 좋겠지만 미련은 없습니다.\n");
    printf("이미 많은 것을 배웠고 저는 더 넓은 세상으로 나갈 준비가 됐습니다.\n");
    printf("제 은사가 되어주셔서 감사합니다.\n");

    printf("- strain7626\n");
}